cf_billing/Documents/бестИзменитьПараметрыТочкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменитьПараметрыТочкиУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТочкиПоставкиТочекУчетаЮЛ</xr:Item>
				<xr:Item>InformationRegister.бестПотериТочекУчета</xr:Item>
				<xr:Item>InformationRegister.бестТехническаяВозможностьУстановкиПУ</xr:Item>
				<xr:Item>InformationRegister.бестСтруктураСетиТочекУчетаНП</xr:Item>
				<xr:Item>InformationRegister.бестЦеновыеКатегорииТочекУчета</xr:Item>
				<xr:Item>InformationRegister.бестТочкиПоставкиОбъектовРасчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегорияБыло</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетВозможностьУстановкиПУБыло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетВозможностьУстановкиПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставкиБыло</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураСетиБыло</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Потери</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПотерь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыПотерь</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированныйОбъемПотерьБыло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерьБыло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированныйОбъемПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестПотериТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПотериТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФиксированныйОбъемПотерь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПотерь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПотерь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыПотерь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестИзменитьПараметрыТочкиУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Таблица потерь
//
// Параметры:
//  МВТ				 - МенеджерВременныхТаблиц 
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации  
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета
//  ТочкаУчета		 - СправочникСсылка.энргТочкиУчета
// 
// Возвращаемое значение:
//  ТаблицаЗначений 
//
Функция ТаблицаПотерь(МВТ, Период, Организация, Район, ОбъектРасчета, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери) КАК ВидПотерь,
	               |	ЕСТЬNULL(бестПотериТочекУчетаСрезПоследних.ФиксированныйОбъемПотерь, 0) КАК ФиксированныйОбъемПотерьБыло,
	               |	ЕСТЬNULL(бестПотериТочекУчетаСрезПоследних.ПроцентПотерь, 0) КАК ПроцентПотерьБыло
	               |ИЗ
	               |	Итог КАК Итог
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПотериТочекУчета.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета
	               |					И ТочкаУчета = &ТочкаУчета
	               |					И ВидПотерь = ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери)
	               |					И (ТарифнаяЗона) В
	               |						(ВЫБРАТЬ
	               |							Итог.ТарифнаяЗона
	               |						ИЗ
	               |							Итог КАК Итог)) КАК бестПотериТочекУчетаСрезПоследних
	               |		ПО Итог.ОбъектРасчета = бестПотериТочекУчетаСрезПоследних.ОбъектРасчета
	               |			И Итог.ТочкаУчета = бестПотериТочекУчетаСрезПоследних.ТочкаУчета
	               |			И Итог.ТарифнаяЗона = бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции    

#КонецОбласти

#КонецЕсли
